# x = ["Антон", "Данил", "Кирилл"]
# x.append("Вова")  # метод добавления элемента в список
# x.append("Лена")  # метод добавления элемента в список
# if len(x) == 3:  # если длина(количество элементов) x равна 3
#     print(3)
# elif len(x) == 4:  # если же элементов четыре
#     print("Ты что-то сюда добавил?")
# else:
#     print("Их не 3 и не 4")

# month = int(input("Введи номер месяца: "))
# if month >= 1 and month <= 12:
#     if month >= 3 and month <= 5:  # если месяц от 3 до 5
#         print("Весна")
#     elif month >= 6 and month <= 8:
#         print("Лето")
#     elif month >= 9 and month <= 11:
#         print("Осень")
#     else:
#         print("Зима")
# else:
#     print("Месяца от 1 до 12, вообще-то")

# h = int(input("Часы: "))
# m = int(input("Минуты: "))
# s = int(input("Секунды: "))
# if 0 <= h <= 23 and 0 <= m <= 59 and 0 <= s <= 59:
#     print("Формат верный")
# else:
#     print("Формат не верный")
#     if h < 0 or h > 23:
#         print("Часы некорректны [0, 23]")
#     if m < 0 or m > 59:
#         print("Минуты некорректны [0, 59]")
#     if s < 0 or s > 59:
#         print("Секунды некорректны [0, 59]")

count = 0
q1 = input("Планета Земля какая по счёту(от Солнца)\n"
            "a) 2, б) 3, в)4, г)5\n"
            "--> ")
if q1 == "б":
    count = count + 1
else:
    print("Неправильно(")
    print("Ты набрал 0 баллов")
    quit()

q2 = input("Сколько позвонков у человека?\n"
            "a) 8, б) 10, в)12, г)14\n"
            "--> ")

if q2 == "в":
    count = count + 1
else:
    print("Неправильно(")
    print("Ты набрал 1 бал")
    quit()

q3 = input("Сколько персонажей в Dota2?\n"
            "a) 95, б) 107, в)115, г)121\n"
            "--> ")
if q3 == "г":
    count = count + 1
else:
    print("Неправильно(")
    print("Ты набрал 2 балов")
    quit()

print("Ты победил! Твой счёт:", count)
