# x = 7
# if x == 5:  # False
#     print("Я не сработаю 😣")
# elif x > 5:
#     print("x > 5 🤓")
# else:  # если не сработает if или elif
#     print("Я, вероятно сработаю 🙂")
#
# word_1 = input("Введи слово (1/2): ")
# word_2 = input("Введи слово (2/2): ")
#
# word_1 = word_1.lower()
# word_2 = word_2.lower()
#
# if word_1.isalpha() and word_2.isalpha():
#
#     sorted_w1 = sorted(word_1)
#     sorted_w2 = sorted(word_2)
#
#     print(sorted_w1)
#     print(sorted_w2)
#
#     if sorted_w1 == sorted_w2:
#         print("Ура, у вас анаграмма 😎")
#     else:
#         print("Ну не фортануло, не получилось :(")
#
# else:
#     print("Хочу только букавы 🔤")

q1 = input("Скока будит 2 + 2?\n"
           "а) 4, б) 5\n"
           "--> ")
if q1 == "а" or q1 == "4":
    print("Праильна 😎")
else:
    print("Одна ошибка и ты ошибся 🐺")
    quit()

q2 = input("Арбуз - это(с ботанической точки зрения)..?\n"
           "а) корнеплод, б) овощ, в) то от чего обоссышься, г) ягода\n"
           "--> ")
if q2 == "г":
    print("Праильна 😎")
else:
    print("Одна ошибка и ты ошибся 🐺")
    quit()

q3 = input("Что такое цуцванг?\n"
           "а) положение в шашках и шахматах, в котором любой ход игрока ведёт к ухудшению его позиции.\n"
           "б) порода обезъян\n"
           "в) поджанр аниме, посвященный Егору\n"
           "г) когда физически цепь замкнута, но ток не проходит\n"
           "--> ")
if q3 == "а":
    print("Ну как бы да, в общем-то правильно 😉")
elif q3 == "в":
    print("Партия гордится тобой. Плюс второй порция миска рис.")
else:
    print("Ну нет, правильный ответ был 'В'")
    quit()

print("Ты победил, респектуха! 🆒")


